[{
    "De":  "03/2022",
    "Ate": "Present",
    "Description": [
        "Developed, tested and maintained a web App for Infrastructure as Code.",
        "Established and oversaw GitHub actions and reusable workflows to guarantee code quality.",
        "Engaged in collaboration with the Product Owner and Stakeholders to articulate the project's vision and roadmap."
    ],
    "JobTitle":  "Fullstack Developer",
    "Company":   "Critical Techworks",
    "Where":     "Oporto",
    "WhereLink": "https://goo.gl/maps/pBKxevEVCuREvH3y8",
    "Stack":     "GraphQL, Golang, NodeJS, React, Python, AWS + Terraform, DynamoDB, Mongo, Kubernetes, React, Docker, Linux, GitHub"
},
{
    "De":  "10/2022",
    "Ate": "02/2023",
    "Description": [
        "Designed event-driven microservices to support a web application for loans targeting the Portugal and Spain markets."
    ],
    "JobTitle":  "Backend Developer",
    "Company":   "CapGemini",
    "Where":     "Lisbon",
    "WhereLink": "https://bit.ly/3DUpYy6",
    "Stack":     "Golang, Postgres, RabbitMQ, Docker, GCP, Kubernetes, Travis"
},
{
    "De":  "04/2021",
    "Ate": "10/2022",
    "Description": [
        "Conceptualized and built an application for Industrial Property management.",
        "Mentored an intern, offering guidance and sharing knowledge on architectural concepts and principles.",
        "Constructed Continuous Integration/Continuous Deployment (CI/CD) pipelines and containers for deploying applications."
    ],
    "JobTitle":  "Fullstack Developer",
    "Company":   "Techframe, SA",
    "Where":     "Abrantes",
    "WhereLink": "https://bit.ly/3n53FNo",
    "Stack":     "Angular, Docker, Golang"
},
{
    "De":  "07/2020",
    "Ate": "03/2021",
    "Description": [
        "Developed ETL (Extract, Transform, Load) scripts and optimized APIs for internal frontend applications.",
        "Designed and developed dashboards to enhance stakeholders' data visualization capabilities.",
        "Established APIs to be utilized by front-end applications in multiple projects."
    ],
    "JobTitle":  "Fullstack Developer",
    "Company":   "Softinsa, IBM",
    "Where":     "Tomar",
    "WhereLink": "https://bit.ly/35vZgeX",
    "Stack":     "T-SQL, Node.js, Python"
}
]